{
  "pokemon": [
    {
      "id": 25,
      "Name": "Pikachu",
      "Img": "pikachu.png",
      "Type": [
        "Electric"
      ],
      "Desc": "Pikachu, Pika türünden çıkmış bir Pokémo'dur. Kolaylıkla fark edilen özellikleri; sarı tüylerinin ve sırtında kahverengi çizgilerinin olmasıdır. Yanaklarındaki kırmızı noktalardan elektrik salınımı yapar. Vücudundaki elektriğin yayımı sayesinde çeşitli saldırılarla genellikle karşısındaki rakibi geçici olarak felç eder. Pikachu'nun yanaklarındaki elektrik panelleri herhangi bir akıma karşı çok hassastır. Gerilimin fazla olduğu manyetik alanlarda Pikachu hastalanabilir. Genellikle güç alanlarının yakınlarında bulunur. Yaşamak için bedeninde dolanan bir akıma ihtiyaç duyan Pikachu, diğer elektrik Pokémonlarıyla iletişim kurmak için kıvılcımlarından faydalanabilir.",
      "BColor": "#f7dc6f",
      "FColor": "#000000",
      "Prev": [
        "Pichu"
      ],
      "Next": [
        "Raichu"
      ],
      "Ability": [
        "Static"
      ],
      "Rating": {
        "Score": 174,
        "Total": 253
      }
    },
    {
      "id": 5,
      "Name": "Charmander",
      "Img": "charmander.png",
      "Type": [
        "Fire"
      ],
      "Desc": "Charmander, kuyruğunda alev bulunan bir kertenkele Pokémo'udur. Bu ışık  Pokémo'un sağlık durumunu gösterir. Alev zayıfsa, Pokemon çok iyi değil ve ilgilenilmesi gerekmektedir. İlk aşamalarda 60 cm'ye kadar boyu vardır ve 8.5 kg ağırlığındadır. Düşman pet ana hasar o bir ejderha tabanı gibi, nefes alevleri, ilgilenir. İlk başta, daha doğrusu zayıf düşmana hasar seviyesi ancak Charmander evrimi bu eksikliği gidermek için yardımcı olacaktır. ",
      "BColor": "#ef875c",
      "FColor": "#ffffff",
      "Prev": [],
      "Next": [
        "Charmeleon"
      ],
      "Ability": [
        "Blaze"
      ],
      "Rating": {
        "Score": 157,
        "Total": 194
      }
    },
    {
      "id": 2,
      "Name": "Ivysaur",
      "Img": "ivysaur.png",
      "Type": [
        "Grass",
        "Poison"
      ],
      "Desc": "Ivysaur, mavi-yeşil lekeli, kurbağa ve dinozor benzeri bir Pokémo'dur. Gözleri parlak kırmızıdır, ancak bu Pokémo'un en önemli özelliği sırtında taşıdığı çiçek tomurcuğudur. Bulbasaur Ivysaur'ın evrimleşmemiş halidir. Bulbasaurken dişleri küçüktü, kulakiçi belli değildi ve gözbebekleri daha küçüktü. Ivysaur'ın rengi Bulbasaur'dan daha mavidir. Ivysaur'ın görüntüsüdeki en büyük fark çiçek soğanı artık bir çiçek tomurcuğu olmuştu. Bu tomurcuk ağır olduğundan arka bacakları kuvvetlenir ancak büyümek pahasına ayağa kalkma yeteneğini yitirir.",
      "BColor": "#35687a",
      "FColor": "#fff",
      "Prev": [
        "Bulbasaur"
      ],
      "Next": [
        "Venusaur"
      ],
      "Ability": [
        "Overgrow"
      ],
      "Rating": {
        "Score": 24,
        "Total": 36
      }
    },
    {
      "id": 40,
      "Name": "Jigglypuff",
      "Img": "jigglypuff.png",
      "Type": [
        "Normal",
        "Fairy"
      ],
      "Desc": "Jigglypuff, şarkı söylediğinde herkesi uyutma gibi bir özelliği vardır. Jigglypuff uyuyan kişilere çok kızar ve yüzlerini çeşitli şekillere boyayıp onları cezalandırır. Gelişmemiş formu Igglybuff, gelişmiş formu Wigglytuff'tır. Wigglytuff, Jigglypuff kadar sevimli değildir ve Jigglypuff'a nazaran 7 kat güçlenmiştir. Wigglytuff normal ve peri türünde bir balon pokémonu olarak bilinir. Büyük yuvarlak gözlere, tavşan kulaklara ve bir tutam pembe saça sahiptir. Güzel kürkü, kendisine dokundurmaya teşvik eder. Havayı içine çekerek bedenini genişletebilir. Bir peri pokemonu olan Wigglytuff, evrimin son aşamasındadır. Aynı zamanda ilk nesil pokemonlardan biridir. Wigglytuff daha fazla gelişemez, bir gelişmemiş hali Jigglypuff’tır.",
      "BColor": "#f1d9e3",
      "FColor": "#000",
      "Prev": [
        "Igglybuff"
      ],
      "Next": [
        "Wigglytuff"
      ],
      "Ability": [
        "Cute Charm",
        "Competitive"
      ],
      "Rating": {
        "Score": 8,
        "Total": 14
      }
    },
    {
      "id": 117,
      "Name": "Seadra",
      "Img": "seadra.png",
      "Type": [
        "Water"
      ],
      "Desc": "Seadra, hayali Pokémon türlerinden biridir. Horsea gibi hem zehir, hem de su pokemonudur. Seadra zehri ile suyu karıştırıp saldırı yapabilme özelliğine sahiptir. Seadra bir kez daha evrimleşirse Kingdra'ya dönüşür, evrimin ikinci aşamasıdır. Bir gelişmemiş hali Horsea'dır.",
      "BColor": "#30a7d7",
      "FColor": "#000",
      "Prev": [
        "Horsea"
      ],
      "Next": [
        "Kingdra"
      ],
      "Ability": [
        "Poison Point",
        "Sniper"
      ],
      "Rating": {
        "Score": 25,
        "Total": 30
      }
    },
    {
      "id": 26,
      "Name": "Raichu",
      "Img": "raichu.png",
      "Type": [
        "Electric"
      ],
      "Desc": "Raichu, Pikachu'nun evrimleşmiş hali bir Pokémondur. Yüksek bir elektrik gücü vardır. Ash Pikachu'yu Raichu'ya çevirmemiştir. Pikachu Yıldırım Taşı kullanılarak Raichu olabilir. Raichu'nun su Pokémonlarına karşı büyük bir etkisi vardır. Hiper ışın, yıldırım gibi saldırıları kullanabilir. Çok çılgın bir pokemondur. Diğer adı Pika killer'dır.Güçlü yıldırım saldırısı bir Dragonite bile felç edebilir.Elektrik taşıyla erken evrim geçirirse Pikachu'nun yaptığı hızlı saldırıları yapamaz.",
      "BColor": "#f7dc6f",
      "FColor": "#000000",
      "Prev": [
        "Pikachu"
      ],
      "Next": [],
      "Ability": [
        "Static"
      ],
      "Rating": {
        "Score": 50,
        "Total": 64
      }
    },
    {
      "id": 37,
      "Name": "Vulpix",
      "Img": "vulpix.png",
      "Type": [
        "Fire"
      ],
      "Desc": "Vulpix tilki benzeri bir ateş pokemo'udur. Evrim geçirip daha fazla kuyruk kazanır ve Ninetales'e dönüşür.",
      "BColor": "#ef875c",
      "FColor": "#ffffff",
      "Prev": [],
      "Next": [
        "Ninetales"
      ],
      "Ability": [
        "Flash Fire"
      ],
      "Rating": {
        "Score": 24,
        "Total": 27
      }
    },
    {
      "id": 43,
      "Name": "Oddish",
      "Img": "oddish.png",
      "Type": [
        "Grass",
        "Poison"
      ],
      "Desc": "Oddish, Plimp olarak da bilinir. Bitki ve zehir tipi Pokémon türünden biridir. Oddish 'tuhaf' anlamına gelen odd ve turp anlamına gelen 'radish' sözcüklerinin birleşmesiyle oluşmuştur. Orijinal Japonca isminde ise 'Nazono' gizemli, enigmatik anlamlarına gelirken 'Kusa' da çimen anlamına gelir.",
      "BColor": "#35687a",
      "FColor": "#ffffff",
      "Prev": [],
      "Next": [
        "Gloom"
      ],
      "Ability": [
        "Chlorophyll"
      ],
      "Rating": {
        "Score": 5,
        "Total": 7
      }
    },
    {
      "id": 64,
      "Name": "Kadabra",
      "Img": "kadabra.png",
      "Type": [
        "Psychic"
      ],
      "Desc": "Kadabra, sarı tonları hakim insansı bir pokemondur. Uzun kulakları alnında pembe bir yıldızı ve uzun bıyıkları vardır. Eğer başı ağrırsa tuhaf bir alfa dalgası yayar. Sadece özellikle güçlü bir ruha sahip olanlar bu Pokémon’un eğitmeni olmayı umabilirler. ",
      "BColor": "#f688c8",
      "FColor": "#fff",
      "Prev": [
        "Abra"
      ],
      "Next": [
        "Alakazam"
      ],
      "Ability": [
        "Inner Focus",
        "Synchronize"
      ],
      "Rating": {
        "Total": 36,
        "Score": 35
      }
    },
    {
      "id": 93,
      "Name": "Haunter",
      "Img": "haunter.png",
      "Type": [
        "Ghost",
        "Poison"
      ],
      "Desc": "Haunter, tüm evrimleri gibi Hayalet ve Zehir türüne sahiptir. Bu kombinasyona sahip başka bir Pokémon yoktur. Maçlarda Hayalet, Psişik ve Karanlık saldırılarından iki kat hasar almakta; Zehir, Böcek, Bitki ve Peri saldırılarından yarım hasar almakta; Normal, Dövüş ve Yer türlerinden hiç hasar almamakta; geri kalan türlerden normal değerde hasar almaktadır.",
      "BColor": "#485648",
      "FColor": "#fff",
      "Prev": [
        "Gastly"
      ],
      "Next": [
        "Gengar"
      ],
      "Ability": [
        "Levitate"
      ],
      "Rating": {
        "Total": 18,
        "Score": 17
      }
    },
    {
      "id": 470,
      "Name": "Leafeon",
      "Img": "leafeon.png",
      "Type": [
        "Grass"
      ],
      "Desc": "Leafeon Pokémon serisinin 493 özel karakterinden biridir. Adını 'leaf' yani anlamı yaprak olan İngilizce kelimeden almıştır. Pokémon serisinin ilk jenerasyonu olan Eevee'nin bitki gelişmişidir.",
      "BColor": "#9bcc50",
      "FColor": "#fff",
      "Prev": [
        "Eevee"
      ],
      "Next": [],
      "Ability": [
        "Leaf Guard"
      ],
      "Rating": {
        "Score": 42,
        "Total": 50
      }
    },
    {
      "id": 148,
      "Name": "Dragonair",
      "Img": "dragonair.png",
      "Type": [
        "Dragon"
      ],
      "Desc": "Dragonair, bu pokemon bozulmamış göllerde ve okyanuslarda yaşar. Hava durumunu kontrol edebilimektedir, Gücünü kullanarak ookyanusların üzerinden rüzgarı kontrol ederek gökyüzüne doğru uçabilir.",
      "BColor": "#BC807F",
      "FColor": "#fff",
      "Prev": [
        "Dratini"
      ],
      "Next": [
        "Dragonite"
      ],
      "Ability": [
        "Shed Skin"
      ],
      "Rating": {
        "Score": 37,
        "Total": 37
      }
    },
    {
      "id": 151,
      "Name": "Mew",
      "Img": "mew.png",
      "Type": [
        "Psychic"
      ],
      "Desc": "Mew, son zamanlarda Japonya Kıtası'nda keşfedilmiş, Faraway Island denilen yerde yaşayan, bilinmeyen ve eski bir uygarlığa ait gizemli psişik tipi, efsanevi bir Pokémondur. Aynı zamanda, bilim insanları teorisi gerekçesi ile; Mew'in bütün pokemonların atası olduğu düşünülmektedir. Dış görünüş olarak miyavlamakta olan uçan çocuksu bir kediden farkı yoktur. Kanto kıtası pokemonlarının yani 1.nesil pokemonlarının sonuncusudur ve ulusal pokedex numarası 151'dir. Öğrenme yeteneği, yani zekası en yüksek olan pokemondur. Hatta bu olay gizemli pokemon kaynaklarında da belirtilmiştir. Üstelik Mew, çok zeki olduğundan dolayı bütün pokemonların saldırısını kullanabilir, tüm makineye bağlanmış pokemon saldırılarını (TM - HM) kullanmayı öğrenebilir ve geçici süre diğer pokemonlara dönüşebilir artı dönüştüğü pokemonların bütün özelliklerini kullanabilir.Mew aynı zamanda itaatsizliğiyle tanınan bir pokemondur, bu oyunlarda da gösterilmiştir Mewtwo'yu trade ile başka bir konsola gönderdiğinde mew ortaya çıkıyor.Bunun dışında elde edildiğinde itaat etmiyor.",
      "BColor": "#f688c8",
      "FColor": "#fff",
      "Prev": [],
      "Next": [],
      "Ability": [
        "Synchronize"
      ],
      "Rating": {
        "Score": 291,
        "Total": 292
      }
    },
    {
      "id": 172,
      "Name": "Pichu",
      "Img": "pichu.png",
      "Type": [
        "Electric"
      ],
      "Desc": "Pichu, Pikachu'nun evrimleşmeden önceki hali olan 172 numaralı bebek evredeki Pokémon. Pokémon video oyunlarından Pokémon Gold ve Silver'de ilk defa sahneye çıkmıştır. Pokémon anime versiyonunda ise ilk serinin 179. bölümü \"Pikachu to Pichu ve Pokemon Advance Generation serisinin de 179. bölümü'de çıkmıştır.",
      "BColor": "#f7dc6f",
      "FColor": "#000000",
      "Prev": [],
      "Next": [
        "Pikachu"
      ],
      "Ability": [
        "Static"
      ],
      "Rating": {
        "Score": 66,
        "Total": 79
      }
    },
    {
      "id": 133,
      "Name": "Eevee",
      "Img": "eevee.png",
      "Type": [
        "Normal"
      ],
      "Desc": "Görünüşte bu pokémon bir köpek karışımı gibi duruyor. Bu hayvanın kabarık bir koyu kahverengi rengi vardır. Pokémon, 6,5 kg ağırlığında, 30 santimetre yüksekliğe ulaşır. Eevee'nin karakteri oldukça yardımsever ve barışçıldır. Buna ek olarak, pokemon eğitmek kolaydır ve yeni başlayan bir koç için en iyi evcil hayvan olabilir.",
      "BColor": "#a4acaf",
      "FColor": "#000",
      "Prev": [],
      "Next": [
        "Vaporeon",
        "Jolteon",
        "Flareon",
        "Espeon",
        "Umbreon",
        "Leafeon",
        "Glaceon",
        "Sylveon"
      ],
      "Ability": [
        "Run Away",
        "Adaptability"
      ],
      "Rating": {
        "Score": 24,
        "Total": 25
      }
    },
    {
      "id": 471,
      "Name": "Glaceon",
      "Img": "glaceon.png",
      "Type": [
        "Ice"
      ],
      "Desc": "Glaceon, yarattığı kar yağışının güzelliğine kapılan her kimse daha farkına varmadan donmuş olacaktır",
      "BColor": "#9dd6e5",
      "FColor": "#fff",
      "Prev": [
        "Eevee"
      ],
      "Next": [],
      "Ability": [
        "Snow Cloak"
      ],
      "Rating": {
        "Score": 33,
        "Total": 35
      }
    },
    {
      "id": 201,
      "Name": "Unown",
      "Img": "unown.png",
      "Type": [
        "Psychic"
      ],
      "Desc": "Bu Pokémon antik bir alfabenin harfleri şeklindedir. Antik alfabemi önce çıktı yoksa Unow'larmı bilinmez. Bu konuda araştırmalar sürüyor fakat kayda değer bir ilerleme sağlanamadı.",
      "BColor": "#f688c8",
      "FColor": "#fff",
      "Prev": [],
      "Next": [],
      "Ability": [
        "Levitate"
      ],
      "Rating": {
        "Score": 66,
        "Total": 95
      }
    },
    {
      "id": 149,
      "Name": "Dragonite",
      "Img": "dragonite.png",
      "Type": [
        "Dragon",
        "Flying"
      ],
      "Desc": "It’s a kindhearted Pokémon. If it spots a drowning person or Pokémon, Dragonite simply must help them.",
      "BColor": "#e8a14f",
      "FColor": "#fff",
      "Prev": [
        "Dragonair"
      ],
      "Next": [],
      "Ability": [
        "Inner Focus"
      ],
      "Rating": {
        "Score": 66,
        "Total": 67
      }
    },
    {
      "id": 95,
      "Name": "Onix",
      "Img": "onix.png",
      "Type": [
        "Rock",
        "Ground"
      ],
      "Desc": "Onix is a Pokémon composed of a giant chain of gray boulders that become smaller towards the tail. Its length makes it the tallest Rock-type Pokémon. It has black eyes and a rounded snout. On top of its head is a rocky spine. As it grows older, it becomes more rounded and smoother, eventually becoming similar to black diamonds. Inside its brain is a magnet that serves as an internal compass, guiding Onix wherever they need to go and prevents them from getting lost while digging.",
      "BColor": "#faf68c",
      "FColor": "#000",
      "Prev": [],
      "Next": [
        "Steelix"
      ],
      "Ability": [
        "Rock Head",
        "Sturdy"
      ],
      "Rating": {
        "Score": 0,
        "Total": 1
      }
    },
    {
      "id": 700,
      "Name": "Sylveon",
      "Img": "sylveon.png",
      "Type": [
        "Fairy"
      ],
      "Desc": "By releasing enmity-erasing waves from its ribbonlike feelers, Sylveon stops any conflict.",
      "BColor": "#ffb3d9",
      "FColor": "#000",
      "Prev": [
        "Eevee"
      ],
      "Next": [],
      "Ability": [
        "Cute Charm"
      ],
      "Rating": {
        "Score": 29,
        "Total": 33
      }
    },
    {
      "id": 142,
      "Name": "Aerodactyl",
      "Img": "aerodactyl.png",
      "Type": [
        "Rock",
        "Flying"
      ],
      "Desc": "This is a ferocious Pokémon from ancient times. Apparently even modern technology is incapable of producing a perfectly restored specimen. ",
      "BColor": "#c9c8d9",
      "FColor": "#000",
      "Prev": [],
      "Next": [],
      "Ability": [
        "Rock Head",
        "Pressure"
      ],
      "Rating": {
        "Score": 5,
        "Total": 6
      }
    },
    {
      "id": 44,
      "Name": "Gloom",
      "Img": "gloom.png",
      "Type": [
        "Grass",
        "Poison"
      ],
      "Desc": "Gloom, tepesindeki bitki kısmına ait olan dişi organ çok kötü bir koku yayamaktadır. Bu yayılan kokuyu 1.25 mil öteden bile alamk mümkündür. Oddish'in bir sonraki evresidir. Vileplume ve Bellosom türlerinin ikisinden birine evrilebilir.",
      "BColor": "#35687a",
      "FColor": "#ffffff",
      "Prev": [
        "Oddish"
      ],
      "Next": [
        "Vileplume",
        "Bellossom"
      ],
      "Ability": [
        "Chlorophyll"
      ],
      "Rating": {
        "Score": 7,
        "Total": 8
      }
    },
    {
      "id": 182,
      "Name": "Bellossom",
      "Img": "bellossom.png",
      "Type": [
        "Grass"
      ],
      "Desc": "Tropikal bir pokemon. Yapraklarından hoş bir ses çıkar.",
      "BColor": "#9bcc50",
      "FColor": "#ffffff",
      "Prev": [
        "Gloom"
      ],
      "Next": [],
      "Ability": [
        "Chlorophyll"
      ],
      "Rating": {
        "Score": 10,
        "Total": 13
      }
    },
    {
      "id": 45,
      "Name": "Vileplume",
      "Img": "vileplume.png",
      "Type": [
        "Grass",
        "Poison"
      ],
      "Desc": "Vileplume, yapraklarından zehirli gaz yayılamktadır. Gloom gibi tepesindeki bitki kısmına ait olan dişi organ çok kötü bir koku yayamaktadır.",
      "BColor": "#35687a",
      "FColor": "#ffffff",
      "Prev": [
        "Gloom"
      ],
      "Next": [],
      "Ability": [
        "Chlorophyll"
      ],
      "Rating": {
        "Score": 13,
        "Total": 15
      }
    },
    {
      "id": 56,
      "Name": "Mankey",
      "Img": "mankey.png",
      "Type": [
        "Fighting"
      ],
      "Desc": "Mankey maymunsu bir Pokemondur. Bu çevik pokempn ağaçlarda yaşar. It angers easily and will not hesitate to attack anything. ",
      "BColor": "#ff4d4d",
      "FColor": "#000",
      "Prev": [],
      "Next": [
        "Primeape"
      ],
      "Ability": [
        "Vital Spirit",
        "Anger Point"
      ],
      "Rating": {
        "Score": 10,
        "Total": 16
      }
    },
    {
      "id": 261,
      "Name": "Poochyena",
      "Img": "poochyena.png",
      "Type": [
        "Dark"
      ],
      "Desc": "At first sight, Poochyena takes a bite at anything that moves. This Pokémon chases after prey until the victim becomes exhausted. However, it may turn tail if the prey strikes back.",
      "BColor": "#222",
      "FColor": "#fff",
      "Prev": [],
      "Next": [
        "Mightyena"
      ],
      "Ability": [
        "Run Away",
        "Quick Feet"
      ],
      "Rating": {
        "Score": 14,
        "Total": 17
      }
    },
    {
      "id": 99004,
      "Name": "Not Found",
      "Img": "notfound.png",
      "Type": [
        "Ghost"
      ],
      "Desc": "Aradığın pokemon bulunamadı. Henüz eklenmemiş olabilir.",
      "BColor": "#9e939e",
      "FColor": "#fff",
      "Prev": [],
      "Next": [
        "Mew",
        "Unown"
      ],
      "Ability": [],
      "Rating": {
        "Score": 5,
        "Total": 538
      }
    }
  ],
  "type": [
    {
      "id": 1,
      "Name": "Fire"
    },
    {
      "id": 2,
      "Name": "Electric"
    },
    {
      "id": 3,
      "Name": "Water"
    },
    {
      "id": 4,
      "Name": "Ghost"
    },
    {
      "id": 5,
      "Name": "Dragon"
    }
  ]
}