{
  "pokemon": [
    {
      "id": 2,
      "Name": "Ivysaur",
      "Img": "ivysaur.png",
      "Type": [
        "Grass",
        "Poison"
      ],
      "Desc": "Ivysaur, Bulbasaur'un evrimleşmiş hali olmaktadır. Sırtındaki ampul daha büyük ve küçük bir bitkiye dönüşmeye başlamıştır. Ivysaur, Çim ve Zehir tipi bir Pokémon'dur. Overgrow adlı yeteneği sayesinde HP düştükçe saldırı gücü artar ve gizli bir yeteneği olan Chlorophyll sayesinde güneşli hava koşullarında hızı artar. Ivysaur, Bulbasaur'dan daha fazla hareket seçeneğine sahiptir, Vine Whip, Razor Leaf, Solar Beam, Petal Dance gibi. Bu nedenle hem saldırı hem de savunma stratejilerinde kullanışlıdır. Eğitmenler arasında popüler bir seçimdir ve sıklıkla başlangıç Pokémon olarak kullanılır.",
      "BColor": "#35687a",
      "FColor": "#afceae",
      "Prev": [
        "Bulbasaur"
      ],
      "Next": [
        "Venusaur"
      ],
      "Ability": [
        "Overgrow"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 4,
      "Name": "Charmander",
      "Img": "charmander.png",
      "Type": [
        "Fire"
      ],
      "Desc": "Charmander, küçük, ejderha benzeri bir Pokémon'dur. Sırtındaki bir yıldız şeklinde parıltılı bir ampul vardır ve adını buradan alır. Charmander, Ateş tipi bir Pokémon'dur. Bu nedenle, Charmander'in saldırıları çoğunlukla ateş tabanlıdır. Charmander'in yetenekleri arasında Blaze bulunur. Blaze, Charmander'in HP azaldıkça saldırı gücünü arttırmasına neden olur. Charmander, eğitmenler arasında popüler bir seçimdir ve sıklıkla başlangıç Pokémon olarak kullanılır. Charmander, yavaş yavaş evrimleşirken, saldırı ve savunma gücünü arttıran yetenekler ve hareketler kazanır. Charmander özellikle oyunların başlangıç seviyelerinde popülerdir ve kolayca eğitilir",
      "BColor": "#ef875c",
      "FColor": "#fffde4",
      "Prev": [],
      "Next": [
        "Charmeleon"
      ],
      "Ability": [
        "Blaze"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 25,
      "Name": "Pikachu",
      "Img": "pikachu.png",
      "Type": [
        "Electric"
      ],
      "Desc": "Pikachu, elektrik tipi bir Pokémon'dur. Küçük, sevimli bir yapıya sahip ve kulaklarının üstünde yer alan bir ampul ile tanınır. Pikachu, keskin zekası, hızlı hareketleri ve güçlü elektrik saldırıları ile ünlüdür.\n\nPikachu'nun yetenekleri arasında Static ve Lightning Rod bulunur. İlki, Pikachu'nun rakip Pokémon'a dokunması durumunda elektrik saldırısı yapmasına neden olurken, ikincisi Pikachu'yu elektrik saldırılarından koruya bilir. Bu yetenekleri sayesinde Pikachu, saldırı ve savunma stratejilerinde etkili bir rol oynar.\n\nPikachu, çok sevilen bir Pokémondur ve sıklıkla eğitmenler tarafından kullanılır. Pikachu, anime ve oyunların popüler karakterlerinden biridir. Çok sayıda tatbikatlar, kostümler, oyuncaklar ve hatta filmler bile Pikachu ile ilgili olarak yapılmıştır. Bu nedenle Pikachu, özellikle çocuklar için oldukça popüler bir Pokémon'dur.",
      "BColor": "#f7dc6f",
      "FColor": "#000000",
      "Prev": [
        "Pichu"
      ],
      "Next": [
        "Raichu"
      ],
      "Ability": [
        "Static"
      ],
      "Rating": {
        "Score": 150,
        "Total": 203
      }
    },
    {
      "id": 26,
      "Name": "Raichu",
      "Img": "raichu.png",
      "Type": [
        "Electric"
      ],
      "Desc": "Raichu, Pikachu'nun evrimleşmiş hali bir Pokémondur. Yüksek bir elektrik gücü vardır. Ash Pikachu'yu Raichu'ya çevirmemiştir. Pikachu Yıldırım Taşı kullanılarak Raichu olabilir. Raichu'nun su Pokémonlarına karşı büyük bir etkisi vardır. Hiper ışın, yıldırım gibi saldırıları kullanabilir. Çok çılgın bir pokemondur. Diğer adı Pika killer'dır.Güçlü yıldırım saldırısı bir Dragonite bile felç edebilir.Elektrik taşıyla erken evrim geçirirse Pikachu'nun yaptığı hızlı saldırıları yapamaz.",
      "BColor": "#f7dc6f",
      "FColor": "#000000",
      "Prev": [
        "Pikachu"
      ],
      "Next": [],
      "Ability": [
        "Static"
      ],
      "Rating": {
        "Score": 52,
        "Total": 67
      }
    },
    {
      "id": 37,
      "Name": "Vulpix",
      "Img": "vulpix.png",
      "Type": [
        "Fire"
      ],
      "Desc": "Vulpix, küçük, tilki benzeri bir Pokémon'dur. Altı tüyleri olan bir kuyruğu vardır ve sıcak bir yerde yaşamak için uygun bir vücuda sahiptir. Vulpix, Ateş tipi bir Pokémon'dur. Bu nedenle, Vulpix'in saldırıları çoğunlukla ateş tabanlıdır. Vulpix'in yetenekleri arasında Drought ve Flash Fire bulunur. Drought, güneşli hava koşullarında Vulpix'in gücünü arttırırken, Flash Fire ateş saldırılarına karşı Vulpix'i korur. Vulpix, ayrıca çok yönlü bir Pokémon'dur ve saldırı, savunma ve destek rolü oynayabilir. Eğitmenler arasında popüler bir seçimdir ve sıklıkla başlangıç Pokémon olarak kullanılır.",
      "BColor": "#ef875c",
      "FColor": "#fffde4",
      "Prev": [],
      "Next": [
        "Ninetales"
      ],
      "Ability": [
        "Flash Fire"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 38,
      "Name": "Ninetales",
      "Img": "ninetales.png",
      "Type": [
        "Fire"
      ],
      "Desc": "Ninetales, Vulpix'in evrimleşmiş hali olarak kabul edilir. Onun kuyruğunda dokuz tüyleri vardır. Ninetales, Ateş tipi bir Pokémon'dur, bu nedenle saldırıları çoğunlukla ateş tabanlıdır. Ninetales'in yetenekleri arasında Drought ve Flash Fire bulunur. Drought, güneşli hava koşullarında Ninetales'in gücünü arttırırken, Flash Fire ateş saldırılarına karşı Ninetales'i korur. Ninetales, ayrıca çok yönlü bir Pokémon'dur ve saldırı, savunma ve destek rolü oynayabilir. Ninetales, eğitmenler arasında popüler bir seçimdir ve sıklıkla başlangıç Pokémon olarak kullanılır. Aynı zamanda Ninetales çok güçlü bir Pokémon'dur ve çeşitli hareketleri, örneğin Fire Spin, Psyshock, Energy Ball vb. var.",
      "BColor": "#ef875c",
      "FColor": "#fffde4",
      "Prev": [
        "Vulpix"
      ],
      "Next": [],
      "Ability": [
        "Flash Fire"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 40,
      "Name": "Jigglypuff",
      "Img": "jigglypuff.png",
      "Type": [
        "Normal",
        "Fairy"
      ],
      "Desc": "Jigglypuff, şarkı söylediğinde herkesi uyutma gibi bir özelliği vardır. Jigglypuff uyuyan kişilere çok kızar ve yüzlerini çeşitli şekillere boyayıp onları cezalandırır. Gelişmemiş formu Igglybuff, gelişmiş formu Wigglytuff'tır. Wigglytuff, Jigglypuff kadar sevimli değildir ve Jigglypuff'a nazaran 7 kat güçlenmiştir. Wigglytuff normal ve peri türünde bir balon pokémonu olarak bilinir. Büyük yuvarlak gözlere, tavşan kulaklara ve bir tutam pembe saça sahiptir. Güzel kürkü, kendisine dokundurmaya teşvik eder. Havayı içine çekerek bedenini genişletebilir. Bir peri pokemonu olan Wigglytuff, evrimin son aşamasındadır. Aynı zamanda ilk nesil pokemonlardan biridir. Wigglytuff daha fazla gelişemez, bir gelişmemiş hali Jigglypuff’tır.",
      "BColor": "#f1d9e3",
      "FColor": "#215486",
      "Prev": [
        "Igglybuff"
      ],
      "Next": [
        "Wigglytuff"
      ],
      "Ability": [
        "Cute Charm",
        "Competitive"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 43,
      "Name": "Oddish",
      "Img": "oddish.png",
      "Type": [
        "Grass",
        "Poison"
      ],
      "Desc": "Oddish, Plimp olarak da bilinir. Bitki ve zehir tipi Pokémon türünden biridir. Oddish 'tuhaf' anlamına gelen odd ve turp anlamına gelen 'radish' sözcüklerinin birleşmesiyle oluşmuştur. Orijinal Japonca isminde ise 'Nazono' gizemli, enigmatik anlamlarına gelirken 'Kusa' da çimen anlamına gelir.",
      "BColor": "#35687a",
      "FColor": "#afceae",
      "Prev": [],
      "Next": [
        "Gloom"
      ],
      "Ability": [
        "Chlorophyll"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 44,
      "Name": "Gloom",
      "Img": "gloom.png",
      "Type": [
        "Grass",
        "Poison"
      ],
      "Desc": "Gloom, tepesindeki bitki kısmına ait olan dişi organ çok kötü bir koku yayamaktadır. Bu yayılan kokuyu 1.25 mil öteden bile alamk mümkündür. Oddish'in bir sonraki evresidir. Vileplume ve Bellosom türlerinin ikisinden birine evrilebilir.",
      "BColor": "#35687a",
      "FColor": "#afceae",
      "Prev": [
        "Oddish"
      ],
      "Next": [
        "Vileplume",
        "Bellossom"
      ],
      "Ability": [
        "Chlorophyll"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 45,
      "Name": "Vileplume",
      "Img": "vileplume.png",
      "Type": [
        "Grass",
        "Poison"
      ],
      "Desc": "Vileplume, yapraklarından zehirli gaz yayılamktadır. Gloom gibi tepesindeki bitki kısmına ait olan dişi organ çok kötü bir koku yayamaktadır.",
      "BColor": "#35687a",
      "FColor": "#afceae",
      "Prev": [
        "Gloom"
      ],
      "Next": [],
      "Ability": [
        "Chlorophyll"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 56,
      "Name": "Mankey",
      "Img": "mankey.png",
      "Type": [
        "Fighting"
      ],
      "Desc": "Mankey maymunsu bir Pokemondur. Bu çevik pokempn ağaçlarda yaşar. It angers easily and will not hesitate to attack anything.",
      "BColor": "#fc5b49",
      "FColor": "#dfdfdf",
      "Prev": [],
      "Next": [
        "Primeape"
      ],
      "Ability": [
        "Vital Spirit",
        "Anger Point"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 64,
      "Name": "Kadabra",
      "Img": "kadabra.png",
      "Type": [
        "Psychic"
      ],
      "Desc": "Kadabra, sarı tonları hakim insansı bir pokemondur. Uzun kulakları alnında pembe bir yıldızı ve uzun bıyıkları vardır. Eğer başı ağrırsa tuhaf bir alfa dalgası yayar. Sadece özellikle güçlü bir ruha sahip olanlar bu Pokémon’un eğitmeni olmayı umabilirler.",
      "BColor": "#f688c8",
      "FColor": "#fae3d2",
      "Prev": [
        "Abra"
      ],
      "Next": [
        "Alakazam"
      ],
      "Ability": [
        "Inner Focus",
        "Synchronize"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 93,
      "Name": "Haunter",
      "Img": "haunter.png",
      "Type": [
        "Ghost",
        "Poison"
      ],
      "Desc": "Haunter, tüm evrimleri gibi Hayalet ve Zehir türüne sahiptir. Bu kombinasyona sahip başka bir Pokémon yoktur. Maçlarda Hayalet, Psişik ve Karanlık saldırılarından iki kat hasar almakta; Zehir, Böcek, Bitki ve Peri saldırılarından yarım hasar almakta; Normal, Dövüş ve Yer türlerinden hiç hasar almamakta; geri kalan türlerden normal değerde hasar almaktadır.",
      "BColor": "#4a4856",
      "FColor": "#e2d8e2",
      "Prev": [
        "Gastly"
      ],
      "Next": [
        "Gengar"
      ],
      "Ability": [
        "Levitate"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 95,
      "Name": "Onix",
      "Img": "onix.png",
      "Type": [
        "Rock",
        "Ground"
      ],
      "Desc": "Onix is a Pokémon composed of a giant chain of gray boulders that become smaller towards the tail. Its length makes it the tallest Rock-type Pokémon. It has black eyes and a rounded snout. On top of its head is a rocky spine. As it grows older, it becomes more rounded and smoother, eventually becoming similar to black diamonds. Inside its brain is a magnet that serves as an internal compass, guiding Onix wherever they need to go and prevents them from getting lost while digging.",
      "BColor": "#faf68c",
      "FColor": "#473602",
      "Prev": [],
      "Next": [
        "Steelix"
      ],
      "Ability": [
        "Rock Head",
        "Sturdy"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 117,
      "Name": "Seadra",
      "Img": "seadra.png",
      "Type": [
        "Water"
      ],
      "Desc": "Seadra, hayali Pokémon türlerinden biridir. Horsea gibi hem zehir, hem de su pokemonudur. Seadra zehri ile suyu karıştırıp saldırı yapabilme özelliğine sahiptir. Seadra bir kez daha evrimleşirse Kingdra'ya dönüşür, evrimin ikinci aşamasıdır. Bir gelişmemiş hali Horsea'dır.",
      "BColor": "#61a6f6",
      "FColor": "#000",
      "Prev": [
        "Horsea"
      ],
      "Next": [
        "Kingdra"
      ],
      "Ability": [
        "Poison Point",
        "Sniper"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 133,
      "Name": "Eevee",
      "Img": "eevee.png",
      "Type": [
        "Normal"
      ],
      "Desc": "Görünüşte bu pokémon bir köpek karışımı gibi duruyor. Bu hayvanın kabarık bir koyu kahverengi rengi vardır. Pokémon, 6,5 kg ağırlığında, 30 santimetre yüksekliğe ulaşır. Eevee'nin karakteri oldukça yardımsever ve barışçıldır. Buna ek olarak, pokemon eğitmek kolaydır ve yeni başlayan bir koç için en iyi evcil hayvan olabilir.",
      "BColor": "#a4acaf",
      "FColor": "#000",
      "Prev": [],
      "Next": [
        "Vaporeon",
        "Jolteon",
        "Flareon",
        "Espeon",
        "Umbreon",
        "Leafeon",
        "Glaceon",
        "Sylveon"
      ],
      "Ability": [
        "Run Away",
        "Adaptability"
      ],
      "Rating": {
        "Score": 24,
        "Total": 25
      }
    },
    {
      "id": 142,
      "Name": "Aerodactyl",
      "Img": "aerodactyl.png",
      "Type": [
        "Rock",
        "Flying"
      ],
      "Desc": "This is a ferocious Pokémon from ancient times. Apparently even modern technology is incapable of producing a perfectly restored specimen. ",
      "BColor": "#c9c8d9",
      "FColor": "#000",
      "Prev": [],
      "Next": [],
      "Ability": [
        "Rock Head",
        "Pressure"
      ],
      "Rating": {
        "Score": 5,
        "Total": 6
      }
    },
    {
      "id": 148,
      "Name": "Dragonair",
      "Img": "dragonair.png",
      "Type": [
        "Dragon"
      ],
      "Desc": "Dragonair, bu pokemon bozulmamış göllerde ve okyanuslarda yaşar. Hava durumunu kontrol edebilimektedir, Gücünü kullanarak ookyanusların üzerinden rüzgarı kontrol ederek gökyüzüne doğru uçabilir.",
      "BColor": "#BC807F",
      "FColor": "#023d80",
      "Prev": [
        "Dratini"
      ],
      "Next": [
        "Dragonite"
      ],
      "Ability": [
        "Shed Skin"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 149,
      "Name": "Dragonite",
      "Img": "dragonite.png",
      "Type": [
        "Dragon",
        "Flying"
      ],
      "Desc": "It’s a kindhearted Pokémon. If it spots a drowning person or Pokémon, Dragonite simply must help them.",
      "BColor": "#e8a14f",
      "FColor": "#013e8a",
      "Prev": [
        "Dragonair"
      ],
      "Next": [],
      "Ability": [
        "Inner Focus"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 151,
      "Name": "Mew",
      "Img": "mew.png",
      "Type": [
        "Psychic"
      ],
      "Desc": "Mew, son zamanlarda Japonya Kıtası'nda keşfedilmiş, Faraway Island denilen yerde yaşayan, bilinmeyen ve eski bir uygarlığa ait gizemli psişik tipi, efsanevi bir Pokémondur. Aynı zamanda, bilim insanları teorisi gerekçesi ile; Mew'in bütün pokemonların atası olduğu düşünülmektedir. Dış görünüş olarak miyavlamakta olan uçan çocuksu bir kediden farkı yoktur. Kanto kıtası pokemonlarının yani 1.nesil pokemonlarının sonuncusudur ve ulusal pokedex numarası 151'dir. Öğrenme yeteneği, yani zekası en yüksek olan pokemondur. Hatta bu olay gizemli pokemon kaynaklarında da belirtilmiştir. Üstelik Mew, çok zeki olduğundan dolayı bütün pokemonların saldırısını kullanabilir, tüm makineye bağlanmış pokemon saldırılarını (TM - HM) kullanmayı öğrenebilir ve geçici süre diğer pokemonlara dönüşebilir artı dönüştüğü pokemonların bütün özelliklerini kullanabilir.Mew aynı zamanda itaatsizliğiyle tanınan bir pokemondur, bu oyunlarda da gösterilmiştir Mewtwo'yu trade ile başka bir konsola gönderdiğinde mew ortaya çıkıyor.Bunun dışında elde edildiğinde itaat etmiyor.",
      "BColor": "#f688c8",
      "FColor": "#fae3d2",
      "Prev": [],
      "Next": [],
      "Ability": [
        "Synchronize"
      ],
      "Rating": {
        "Score": 14,
        "Total": 15
      }
    },
    {
      "id": 172,
      "Name": "Pichu",
      "Img": "pichu.png",
      "Type": [
        "Electric"
      ],
      "Desc": "Pichu, küçük, fare benzeri bir Pokémon'dur ve Pikachu'nun ön evrimidir. Yuvarlak bir vücuda, büyük kulaklar ve yıldırım şeklinde bir kuyruğa sahiptir. Sevimli görünümü ve oyuncul kişiliği ile tanınır. Pichu, Elektrik tipi bir Pokémon'dur ve Static adında bir yeteneği vardır, bu yetenek rakibinin felç olmasına neden olur. Pichu, ayrıca daha küçük ve hafif bir yapıya sahip olduğu için, hızlı hareketler yapmasına ve elektrik saldırıları yapmasına olanak tanır. Pichu, eğitmenler tarafından özellikle Pikachu'nun evrimleşmeden önce kullanılmak üzere seçilir ve sıklıkla başlangıç Pokémon olarak kullanılır.",
      "BColor": "#f7dc6f",
      "FColor": "#000000",
      "Prev": [],
      "Next": [
        "Pikachu"
      ],
      "Ability": [
        "Static"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 182,
      "Name": "Bellossom",
      "Img": "bellossom.png",
      "Type": [
        "Grass"
      ],
      "Desc": "Tropikal bir pokemon. Yapraklarından hoş bir ses çıkar.",
      "BColor": "#9bcc50",
      "FColor": "#ffffff",
      "Prev": [
        "Gloom"
      ],
      "Next": [],
      "Ability": [
        "Chlorophyll"
      ],
      "Rating": {
        "Score": 10,
        "Total": 13
      }
    },
    {
      "id": 201,
      "Name": "Unown",
      "Img": "unown.png",
      "Type": [
        "Psychic"
      ],
      "Desc": "Bu Pokémon antik bir alfabenin harfleri şeklindedir. Antik alfabemi önce çıktı yoksa Unow'larmı bilinmez. Bu konuda araştırmalar sürüyor fakat kayda değer bir ilerleme sağlanamadı.",
      "BColor": "#f688c8",
      "FColor": "#fae3d2",
      "Prev": [],
      "Next": [],
      "Ability": [
        "Levitate"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 261,
      "Name": "Poochyena",
      "Img": "poochyena.png",
      "Type": [
        "Dark"
      ],
      "Desc": "At first sight, Poochyena takes a bite at anything that moves. This Pokémon chases after prey until the victim becomes exhausted. However, it may turn tail if the prey strikes back.",
      "BColor": "#222",
      "FColor": "#fff",
      "Prev": [],
      "Next": [
        "Mightyena"
      ],
      "Ability": [
        "Run Away",
        "Quick Feet"
      ],
      "Rating": {
        "Score": 14,
        "Total": 17
      }
    },
    {
      "id": 470,
      "Name": "Leafeon",
      "Img": "leafeon.png",
      "Type": [
        "Grass"
      ],
      "Desc": "Leafeon Pokémon serisinin 493 özel karakterinden biridir. Adını 'leaf' yani anlamı yaprak olan İngilizce kelimeden almıştır. Pokémon serisinin ilk jenerasyonu olan Eevee'nin bitki gelişmişidir.",
      "BColor": "#9bcc50",
      "FColor": "#fff",
      "Prev": [
        "Eevee"
      ],
      "Next": [],
      "Ability": [
        "Leaf Guard"
      ],
      "Rating": {
        "Score": 42,
        "Total": 50
      }
    },
    {
      "id": 471,
      "Name": "Glaceon",
      "Img": "glaceon.png",
      "Type": [
        "Ice"
      ],
      "Desc": "Glaceon, yarattığı kar yağışının güzelliğine kapılan her kimse daha farkına varmadan donmuş olacaktır",
      "BColor": "#9dd6e5",
      "FColor": "#017064",
      "Prev": [
        "Eevee"
      ],
      "Next": [],
      "Ability": [
        "Snow Cloak"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 700,
      "Name": "Sylveon",
      "Img": "sylveon.png",
      "Type": [
        "Fairy"
      ],
      "Desc": "By releasing enmity-erasing waves from its ribbonlike feelers, Sylveon stops any conflict.",
      "BColor": "#ffb3d9",
      "FColor": "#215486",
      "Prev": [
        "Eevee"
      ],
      "Next": [],
      "Ability": [
        "Cute Charm"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 99004,
      "Name": "Not Found",
      "Img": "notfound.png",
      "Type": [
        "Ghost"
      ],
      "Desc": "Aradığın pokemon bulunamadı. Henüz eklenmemiş olabilir.",
      "BColor": "#9e939e",
      "FColor": "#fff",
      "Prev": [],
      "Next": [
        "Mew",
        "Unown"
      ],
      "Ability": [],
      "Rating": {
        "Score": 6,
        "Total": 554
      }
    },
    {
      "id": 1,
      "Name": "Bulbasaur",
      "Img": "bulbasaur.png",
      "Type": [
        "Grass",
        "Poison"
      ],
      "Desc": "Bulbasaur, dört ayaklı, dinazor benzeri bir Pokémon'dur. Küçük, uçlu kulakları ve sırtında bir ampulü vardır, adını buradan alır.\n\nSırtındaki ampul gerçekte Bulbasaur büyüdükçe büyük bir çiçek olan bir tohumdur. Bulbasaur, Çim ve Zehir tipi bir Pokémon'dur, bu nedenle Yer, Kaya, Su ve Peri tipi Pokémon'a karşı güçlüdür ancak Uçak, Ruhsal ve Ateş tipi Pokémon'a karşı zayıftır.\n\nBulbasaur'un yetenekleri, Overgrow ve Chlorophyll, güneşli hava koşullarında gücünü ve hızını arttırır. Bulbasaur çok çeşitli bir Pokémon'dur, Vine Whip, Razor Leaf ve Solar Beam gibi geniş bir hareket yelpazesine sahiptir, bu nedenle hem saldırı hem de savunma stratejilerinde kullanışlıdır. Eğitmenler arasında popüler bir seçimdir ve sıklıkla başlangıç ​​Pokemon olarak kullanılır.",
      "BColor": "#35687a",
      "FColor": "#afceae",
      "Prev": [],
      "Next": [
        "Ivysaur"
      ],
      "Ability": [
        "Overgrow"
      ],
      "Rating": {
        "Score": 51,
        "Total": 61
      }
    },
    {
      "id": 3,
      "Name": "Venusaur",
      "Img": "venusaur.png",
      "Type": [
        "Grass",
        "Poison"
      ],
      "Desc": "Venusaur, Ivysaur'un evrimleşmiş hali olarak kabul edilir. Sırtındaki ampul büyük ve güzel bir çiçek haline gelmiştir. Venusaur, Çim ve Zehir tipi bir Pokémon'dur. Overgrow adlı yeteneği sayesinde HP düştükçe saldırı gücü artar ve gizli bir yeteneği olan Chlorophyll sayesinde güneşli hava koşullarında hızı artar. Venusaur, Ivysaur'dan daha fazla hareket seçeneğine sahiptir, Vine Whip, Razor Leaf, Solar Beam, Petal Dance, Sleep Powder, Poison Powder gibi. Bu nedenle hem saldırı hem de savunma stratejilerinde kullanışlıdır. Eğitmenler arasında popüler bir seçimdir ve sıklıkla başlangıç Pokémon olarak kullanılır.",
      "BColor": "#35687a",
      "FColor": "#afceae",
      "Prev": [
        "Ivysaur"
      ],
      "Next": [],
      "Ability": [
        "Overgrow"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 5,
      "Name": "Charmeleon",
      "Img": "charmeleon.png",
      "Type": [
        "Fire"
      ],
      "Desc": "Charmeleon, Charmander'in evrimleşmiş hali olarak kabul edilir. Daha büyük ve güçlü bir yapıya sahiptir ve sırtındaki ampul daha parlaktır. Charmeleon, Ateş tipi bir Pokémon'dur. Bu nedenle, Charmeleon'in saldırıları çoğunlukla ateş tabanlıdır. Charmeleon'in yetenekleri arasında Blaze bulunur. Blaze, Charmander'in HP azaldıkça saldırı gücünü arttırmasına neden olur. Charmeleon, eğitmenler arasında popüler bir seçimdir ve sıklıkla başlangıç Pokémon olarak kullanılır. Charmeleon, yavaş yavaş evrimleşirken, saldırı ve savunma gücünü arttıran yetenekler ve hareketler kazanır. Charmeleon aynı zamanda oyunların orta seviyelerinde popülerdir ve çok fazla hareket öğrenir.",
      "BColor": "#ef875c",
      "FColor": "#fffde4",
      "Prev": [
        "Charmander"
      ],
      "Next": [
        "Charizard"
      ],
      "Ability": [
        "Blaze"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 6,
      "Name": "Charizard",
      "Img": "charizard.png",
      "Type": [
        "Fire",
        "Flying"
      ],
      "Desc": "Charizard, Charmeleon'in evrimleşmiş hali olarak kabul edilir. Daha büyük ve güçlü bir yapıya sahiptir ve sırtındaki ampul daha parlaktır. Charizard, Ateş ve Hava tipi bir Pokémon'dur. Bu nedenle, Charizard'in saldırıları hem ateş hem de hava tabanlıdır. Charizard'in yetenekleri arasında Blaze bulunur. Blaze, Charmander'in HP azaldıkça saldırı gücünü arttırmasına neden olur. Charizard, eğitmenler arasında popüler bir seçimdir ve sıklıkla başlangıç Pokémon olarak kullanılır. Charizard, yavaş yavaş evrimleşirken, saldırı ve savunma gücünü arttıran yetenekler ve hareketler kazanır. Charizard, aynı zamanda oyunların en üst seviyelerinde ve turnuvalarda popülerdir çünkü çok güçlü bir Pokémon'dur ve çok fazla hareket öğrenir.",
      "BColor": "#d6a18a",
      "FColor": "#2e2e2e",
      "Prev": [
        "Charmeleon"
      ],
      "Next": [],
      "Ability": [
        "Blaze"
      ],
      "Rating": {
        "Score": 15,
        "Total": 16
      }
    },
    {
      "id": 7,
      "Name": "Squirtle",
      "Img": "squirtle.png",
      "Type": [
        "Water"
      ],
      "Desc": "Squirtle is a small, turtle-like Pokémon that is known for its strong defense and ability to shoot water from its mouth. It has a hard, protective shell on its back and its body is primarily blue in color. Squirtle is a Water-type Pokémon. Its abilities are Torrent and Rain Dish, the first increases the power of its water moves when its HP is low, while the second restore some of its HP in rain. Squirtle is a popular choice among trainers and is often used as a starting Pokémon due to its well-rounded abilities and versatility in battle. It learns several powerful water-based moves such as Water Gun, Hydro Pump, and Bubblebeam which makes it a great addition to any team.",
      "BColor": "#61a6f6",
      "FColor": "#000000",
      "Prev": [],
      "Next": [
        "Wartortle"
      ],
      "Ability": [
        "Torrent"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 8,
      "Name": "Wartortle",
      "Img": "wartortle.png",
      "Type": [
        "Water"
      ],
      "Desc": "Wartortle is the evolved form of Squirtle, and is a larger, more mature version of the Pokémon. It still retains its turtle-like appearance, but now has a thick, furry tail and longer ears. Wartortle is a Water-type Pokémon and its abilities are Torrent and Rain Dish, the first increases the power of its water moves when its HP is low, while the second restore some of its HP in rain. Wartortle is a popular choice among trainers and is often used as a starting Pokémon due to its well-rounded abilities and versatility in battle. It has more hitpoints, attack and defense power than Squirtle and it can learn a wider variety of moves that can take advantage of its well-rounded stats, like Bite, Ice Beam, Aqua Tail, and Rapid Spin. These moves make Wartortle a formidable opponent in battle.",
      "BColor": "#61a6f6",
      "FColor": "#000",
      "Prev": [
        "Squirtle"
      ],
      "Next": [
        "Blastoise"
      ],
      "Ability": [
        "Torrent"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 9,
      "Name": "Blastoise",
      "Img": "blastoise.png",
      "Type": [
        "Water"
      ],
      "Desc": "Blastoise is the final evolution of Squirtle, and is a large and heavily armored turtle-like Pokémon. It is known for its powerful water cannons that are located on its shoulders, and its sturdy and durable shell. Blastoise is a Water-type Pokémon and its abilities are Torrent and Rain Dish, the first increases the power of its water moves when its HP is low, while the second restore some of its HP in rain. Blastoise is a popular choice among trainers and is often used as a starting Pokémon due to its well-rounded abilities and versatility in battle. It has even more hitpoints, attack and defense power than Wartortle and it can learn powerful water-based moves like Hydro Cannon, Skull Bash, Dragon Pulse and Flash Cannon. These moves make Blastoise one of the strongest Pokémon in battle, and it's very useful for both offensive and defensive strategies.",
      "BColor": "#87ceeb",
      "FColor": "#000080",
      "Prev": [
        "Wartortle"
      ],
      "Next": [],
      "Ability": [],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 10,
      "Name": "Caterpie",
      "Img": "caterpie.png",
      "Type": [
        "Bug"
      ],
      "Desc": "For protection, it releases a horrible stench from the antenna on its head to drive away enemies.",
      "BColor": "#408a37",
      "FColor": "#e6f8dc",
      "Prev": [],
      "Next": [
        "Metapod"
      ],
      "Ability": [
        "Shield Dust"
      ],
      "Rating": {
        "Score": 5,
        "Total": 6
      }
    },
    {
      "id": 11,
      "Name": "Metapod",
      "Img": "metapod.png",
      "Type": [
        "Bug"
      ],
      "Desc": "It is waiting for the moment to evolve. At this stage, it can only harden, so it remains motionless to avoid attack.",
      "BColor": "#408a37",
      "FColor": "#e6f8dc",
      "Prev": [
        "Caterpie"
      ],
      "Next": [
        "Butterfree"
      ],
      "Ability": [
        "Shed Skin"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 12,
      "Name": "Butterfree",
      "Img": "butterfree.png",
      "Type": [
        "Bug",
        "Flying"
      ],
      "Desc": "In battle, it flaps its wings at great speed to release highly toxic dust into the air.",
      "BColor": "#95aa83",
      "FColor": "#192e00",
      "Prev": [
        "Metapod"
      ],
      "Next": [],
      "Ability": [
        "Compound Eyes"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 54,
      "Name": "Psyduck",
      "Img": "psyduck.png",
      "Type": [
        "Water"
      ],
      "Desc": "Psyduck is constantly beset by headaches. If the Pokémon lets its strange power erupt, apparently the pain subsides for a while.",
      "BColor": "#61a6f6",
      "FColor": "#000",
      "Prev": [],
      "Next": [
        "Golduck"
      ],
      "Ability": [
        "Damp",
        "Cloud Nine"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 55,
      "Name": "Golduck",
      "Img": "golduck.png",
      "Type": [
        "Water"
      ],
      "Desc": "This Pokémon lives in gently flowing rivers. It paddles through the water with its long limbs, putting its graceful swimming skills on display",
      "BColor": "#61a6f6",
      "FColor": "#000",
      "Prev": [
        "Psyduck"
      ],
      "Next": [],
      "Ability": [
        "Damp",
        "Cloud Nine"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 57,
      "Name": "Primeape",
      "Img": "primeape.png",
      "Type": [
        "Fighting"
      ],
      "Desc": "It stops being angry only when nobody else is around. To view this moment is very difficult.",
      "BColor": "#fc5b49",
      "FColor": "#dfdfdf",
      "Prev": [
        "Monkey"
      ],
      "Next": [],
      "Ability": [
        "Vital Spirit",
        "Anger Point"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 63,
      "Name": "Abra",
      "Img": "abra.png",
      "Type": [
        "Psychic"
      ],
      "Desc": "This Pokémon uses its psychic powers while it sleeps. The contents of Abra’s dreams affect the powers that the Pokémon wields.",
      "BColor": "#f688c8",
      "FColor": "#fae3d2",
      "Prev": [],
      "Next": [],
      "Ability": [
        "Inner Focus",
        "Synchronize"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 65,
      "Name": "Alakazam",
      "Img": "alakazam.png",
      "Type": [
        "Psychic"
      ],
      "Desc": "It has an incredibly high level of intelligence. Some say that Alakazam remembers everything that ever happens to it, from birth till death.",
      "BColor": "#f688c8",
      "FColor": "#fae3d2",
      "Prev": [],
      "Next": [],
      "Ability": [
        "Inner Focus",
        "Synchronize"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 250,
      "Name": "Ho-Oh",
      "Img": "ho-oh.png",
      "Type": [
        "Fire",
        "Flying"
      ],
      "Desc": "Ho-Oh’s feathers glow in seven colors depending on the angle at which they are struck by light. These feathers are said to bring happiness to the bearers. This Pokémon is said to live at the foot of a rainbow.",
      "BColor": "#d6a18a",
      "FColor": "#2e2e2e",
      "Prev": [],
      "Next": [],
      "Ability": [
        "Pressure"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 150,
      "Name": "Mewtwo",
      "Img": "mewtwo.png",
      "Type": [
        "Psychic"
      ],
      "Desc": "Its DNA is almost the same as Mew’s. However, its size and disposition are vastly different.",
      "BColor": "#f688c8",
      "FColor": "#fae3d2",
      "Prev": [],
      "Next": [],
      "Ability": [
        "Pressure"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 194,
      "Name": "Wooper",
      "Img": "wooper.png",
      "Type": [
        "Water",
        "Ground"
      ],
      "Desc": "This Pokémon lives in cold water. It will leave the water to search for food when it gets cold outside.",
      "BColor": "#243456",
      "FColor": "#f1e3d4",
      "Prev": [],
      "Next": [
        "Quagsire"
      ],
      "Ability": [
        "Damp",
        "Water Absorb"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 92,
      "Name": "Gastly",
      "Img": "gastly.png",
      "Type": [
        "Ghost",
        "Poison"
      ],
      "Desc": "Born from gases, anyone would faint if engulfed by its gaseous body, which contains poison.",
      "BColor": "#4a4856",
      "FColor": "#e2d8e2",
      "Prev": [],
      "Next": [
        "Haunter"
      ],
      "Ability": [
        "Levitate"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 778,
      "Name": "Mimikyu",
      "Img": "mimikyu.png",
      "Type": [
        "Ghost",
        "Fairy"
      ],
      "Desc": "It wears a rag fashioned into a Pikachu costume in an effort to look less scary. Unfortunately, the costume only makes it creepier.",
      "BColor": "#b592bd",
      "FColor": "#490138",
      "Prev": [],
      "Next": [],
      "Ability": [
        "Disguise"
      ],
      "Rating": {
        "Score": 129,
        "Total": 143
      }
    },
    {
      "id": 200,
      "Name": "Misdreavus",
      "Img": "misdreavus.png",
      "Type": [
        "Ghost"
      ],
      "Desc": "What gives meaning to its life is surprising others. If you set your ear against the red orbs around its neck, you can hear shrieking.",
      "BColor": "#643f8d",
      "FColor": "#aaddd1",
      "Prev": [],
      "Next": [],
      "Ability": [
        "Levitate"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 9999,
      "Name": "Portakal",
      "Img": "portakal.png",
      "Type": [
        "Grass",
        "Water"
      ],
      "Desc": "Test - Turunçgillerden bir meyve. Akdeniz çevresinde ve sıcaklık ortalaması 23° ila -3°C arasında olan yerlerde yetişen ağaçlardır. Bu ağaçların meyveleri portakal adını alır. Portakal meyveleri tam yuvarlak veya yumurta şeklindedir.",
      "BColor": "#f38b1a",
      "FColor": "#f3c3fc",
      "Prev": [
        "Mandalina"
      ],
      "Next": [
        "Mandalina"
      ],
      "Ability": [
        "Portakal"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 94,
      "Name": "Gengar",
      "Img": "gengar.png",
      "Type": [
        "Ghost",
        "Poison"
      ],
      "Desc": "On the night of a full moon, if shadows move on their own and laugh, it must be Gengar’s doing.",
      "BColor": "#4a4856",
      "FColor": "#e2d8e2",
      "Prev": [
        "Haunter"
      ],
      "Next": [],
      "Ability": [
        "Cursed Body"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 91,
      "Name": "Cloyster",
      "Img": "cloyster.png",
      "Type": [
        "Water",
        "Ice"
      ],
      "Desc": "Its shell is extremely hard. It cannot be shattered, even with a bomb. The shell opens only when it is attacking.",
      "BColor": "#56ceca",
      "FColor": "#08184b",
      "Prev": [
        "Shellder"
      ],
      "Next": [],
      "Ability": [
        "Shell Armor",
        "Skill Link"
      ],
      "Rating": {
        "Score": 20,
        "Total": 22
      }
    },
    {
      "id": 9998,
      "Name": "Mandalina",
      "Img": "mandalina.png",
      "Type": [
        "Water",
        "Grass"
      ],
      "Desc": "Test - Mandalina (Citrus reticulata), ılıman iklimde yetişmekte olan turunçgiller (Rutaceae) familyasına ait bir meyve türü. Turuncu, sarı renklerde olan mandalina, etli ve sulu bir yapıya sahiptir. Partakaldan daha küçük, toparlak veya yassı, sarı-turuncu renkli, usaresi tatlı, hoş kokulu bir meyve.",
      "BColor": "#f38b1a",
      "FColor": "#f3c3fc",
      "Prev": [
        "Portakal"
      ],
      "Next": [
        "Portakal"
      ],
      "Ability": [],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 81,
      "Name": "Magnemite",
      "Img": "magnemite.png",
      "Type": [
        "Electric",
        "Steel"
      ],
      "Desc": "At times, Magnemite runs out of electricity and ends up on the ground. If you give batteries to a grounded Magnemite, it’ll start moving again.",
      "BColor": "#c7c5ad",
      "FColor": "#000",
      "Prev": [],
      "Next": [
        "Magneton"
      ],
      "Ability": [
        "Sturdy",
        "Magnet Pull"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 197,
      "Name": "Umbreon",
      "Img": "umbreon.png",
      "Type": [
        "Dark"
      ],
      "Desc": "When this Pokémon becomes angry, its pores secrete a poisonous sweat, which it sprays at its opponent’s eyes.",
      "BColor": "#222222",
      "FColor": "#ffffff",
      "Prev": [
        "Eevee"
      ],
      "Next": [],
      "Ability": [
        "Synchronize"
      ],
      "Rating": {
        "Score": 3,
        "Total": 5
      }
    },
    {
      "id": 282,
      "Name": "Gardevoir",
      "Img": "gardevoir.png",
      "Type": [
        "Psychic",
        "Fairy"
      ],
      "Desc": "Gardevoir is a humanoid sylph-like, Pokémon. It stands just over five feet tall. The classical tutu-type skirt seen with Kirlia is now a long, flowing white gown that completely covers its legs, giving the appearance that it is floating. Gardevoir have long, slender, white legs underneath their gown. The inside of its gown is green in color. The red horns that were once on Kirlia and Ralts' head have moved down onto Gardevoir's chest and back. Most of its face is obscured by its green 'hair', with only some white, and its large pink eyes visible. It also has long, slender arms that are green like its hair. Upon Mega Evolution, it turns almost completely white; only its hair remains green. Its gown becomes longer and wider, resembling a bridal gown. The forearms are slightly thicker with a pointed extension above the elbow resembling sleeves. Its facial spikes are larger and now curl upwards. In contrast, its hair is now shorter and more tightly curled. There are now two horns in the center of its chest, extending to either side.",
      "BColor": "#e4b4df",
      "FColor": "#000",
      "Prev": [
        "Kirlia"
      ],
      "Next": [],
      "Ability": [
        "Synchronize",
        "Trace",
        "Telepathy"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    },
    {
      "id": 122,
      "Name": "Mr. Mime",
      "Img": "mr.mime.png",
      "Type": [
        "Fairy",
        "Psychic"
      ],
      "Desc": "Mr. Mime (Japanese: バリヤード Barrierd) is a dual-type Psychic/Fairy Pokémon introduced in Generation I. Prior to Generation VI, it was a pure Psychic-type Pokémon.\n\nIt evolves from Mime Jr. when leveled up while knowing Mimic.\n\nIn Galar, Mr. Mime has a dual-type Ice/Psychic regional form. It evolves into Mr. Rime starting at level 42. All Mime Jr. in Galar evolve into this form regardless of their origin. \n\nMr. Mime is a bipedal, humanoid Pokémon. Blue growths resembling clown hair extend from the sides of its pale pink head, and there is a magenta circle on each cheek. Its jaw is curved inward, resembling the mouth of a wooden dummy. It has a round, white body with a magenta spot in the middle, light pink arms and legs that connect to its body via magenta spheres, and small white coverings over its knees. Its white hands resemble gloves with magenta pads on the tips of its white fingers and its dark blue feet curl upward at the tips.\n\nFrom birth, this Pokémon is an excellent pantomime. As it matures, it gains the ability to solidify air molecules by vibrating its fingertips. This ability allows it to create invisible objects with its gestures. It punishes those who interrupt its act or are not impressed by slapping them. Mr. Mime is usually very rare, but can be found in suburban areas. In Generation II, Substitute was its signature move.",
      "BColor": "#e4b4df",
      "FColor": "#000",
      "Prev": [],
      "Next": [],
      "Ability": [
        "Soundproof",
        "Filter",
        "Technician"
      ],
      "Rating": {
        "Score": 1,
        "Total": 1
      }
    }
  ],
  "types":[
    {
        "id": 1,
        "type": "Water",
        "foreground": "#00BFFF",
        "background": "#87CEEB"
    },
    {
        "id": 2,
        "type": "Fire",
        "foreground": "#ff6961",
        "background": "#ffa07a"
    },
    {
        "id": 3,
        "type": "Electric",
        "foreground": "#ffff00",
        "background": "#ffa500"
    },
    {
        "id": 4,
        "type": "Grass",
        "foreground": "#7cfc00",
        "background": "#32cd32"
    },
    {
        "id": 5,
        "type": "Ice",
        "foreground": "#87cefa",
        "background": "#00bfff"
    },
  ]
}